Examinator/src/Documents/НовостьСУО/НовостьСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НовостьСУО</name>
  <registerRecords>InformationRegister.НовостиСУО</registerRecords>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОП/ДанныеВебКабинетаСУО_ОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПП/ДанныеВебКабинетаСУО_ПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НовостиСУО/НовостиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НовостиСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрепить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/НовостьСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Заголовок");
	Поля.Добавить("ДатаПубликации");
 
КонецПроцедуры
	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Формат(Данные.ДатаПубликации, "ДЛФ=DD") + " - " + Данные.Заголовок;
	
КонецПроцедуры

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Новость, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	НовостьОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Новость, "Проведен, ФорматированныйДокумент, Автор");
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОП.УдалитьДанные(Новость, Перечисления.ТипыДанныхВебКабинетаСУО.Новость);
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(Новость, Перечисления.ТипыДанныхВебКабинетаСУО.Новость);
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Новость, Перечисления.ТипыДанныхВебКабинетаСУО.НовостьОписание);	
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Новость, "Документ.НовостьСУО");
	
	Если НовостьОбъект.Проведен Тогда
		
		НовостьJSON = НовостьJSON(Новость);
		НовостьОписаниеXML = НовостьОписаниеОбщееXML(Новость);
		
		// Общее описание
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.НовостьОписание, Новость, НовостьОписаниеXML, Перечисления.ФорматыВебДанныхСУ.xml);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НовостиСУО.Пользователь,
			|	НовостиСУО.Дата
			|ИЗ
			|	РегистрСведений.НовостиСУО КАК НовостиСУО
			|ГДЕ
			|	НовостиСУО.Регистратор = &Новость";
		
		Запрос.УстановитьПараметр("Новость", Новость);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) Тогда
				РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ВыборкаДетальныеЗаписи.Дата, ВыборкаДетальныеЗаписи.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.Новость, Новость, НовостьJSON, Перечисления.ФорматыВебДанныхСУ.json);
			Иначе
				РегистрыСведений.ДанныеВебКабинетаСУО_ОП.ДобавитьДанные(ВыборкаДетальныеЗаписи.Дата, Перечисления.ТипыДанныхВебКабинетаСУО.Новость, Новость, НовостьJSON, Перечисления.ФорматыВебДанныхСУ.json);
			КонецЕсли;
			
		КонецЦикла;
		
		// Файлы новости
		
		ТекстНовостиСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(НовостьОбъект.ФорматированныйДокумент.Получить(), Строка(Новость.УникальныйИдентификатор()),, Истина, Ложь);
		
		Если ТекстНовостиСтруктура.ЕстьВложения Тогда
			ВебКабинетСУО.ВыгрузитьФайлыФорматированногоДокументаВКаталогВебКабинета(ТекстНовостиСтруктура.ДвоичныеДанные, ТекстНовостиСтруктура.ИдентификаторКаталога);
		КонецЕсли;		
		
		// Зависимости
		
		Зависимости = Новый Массив;
		Зависимости.Добавить(НовостьОбъект.Автор);
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Новость, "Документ.НовостьСУО", Зависимости);
		
	КонецЕсли;	
	
	
КонецПроцедуры

Функция НовостьJSON(Новость) Экспорт
	
	ДанныеНовости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Новость, "Заголовок, Выделить, Закрепить, ДатаПубликации, Автор, Автор.Наименование, Номер");
	
	АвторОписание = Новый Структура("Наименование, Идентификатор", ДанныеНовости.АвторНаименование, Строка(ДанныеНовости.Автор.УникальныйИдентификатор()));
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(Новый Структура("Заголовок, Выделить, Закрепить, ДатаПубликации, Автор, Номер, Идентификатор", ДанныеНовости.Заголовок, ДанныеНовости.Выделить, ДанныеНовости.Закрепить, ДанныеНовости.ДатаПубликации, АвторОписание, ДанныеНовости.Номер, Строка(Новость.УникальныйИдентификатор())));
	
КонецФункции

Функция НовостьОписаниеОбщееXML(Новость) Экспорт
	
	ДанныеНовости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Новость, "Заголовок, Выделить, Закрепить, ДатаПубликации, Автор.Наименование, Автор, Номер, ФорматированныйДокумент");
	
	НовостьXDTOТип      = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/3/News","Новость");
	ПользовательXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/User","Пользователь");
	
	НовостьXDTO = ФабрикаXDTO.Создать(НовостьXDTOТип);
	
	НовостьXDTO.Заголовок = ДанныеНовости.Заголовок;
	НовостьXDTO.Номер     = ДанныеНовости.Номер;
	НовостьXDTO.Дата      = ДанныеНовости.ДатаПубликации;
	НовостьXDTO.ДатаЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДанныеНовости.ДатаПубликации);
	
	ТекстНовостиСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ДанныеНовости.ФорматированныйДокумент.Получить(), Строка(Новость.УникальныйИдентификатор()),,Ложь,Истина);
	
	НовостьXDTO.Текст = СокрЛП(ТекстНовостиСтруктура.ПредставлениеHTML);
	
	ПользовательXDTO = ФабрикаXDTO.Создать(ПользовательXDTOТип);
	
	ПользовательXDTO.Ссылка = ДанныеНовости.Автор;
	Если ЗначениеЗаполнено(ДанныеНовости.Автор) Тогда
		ПользовательXDTO.ПолноеИмя = ДанныеНовости.АвторНаименование;
	Иначе
		ПользовательXDTO.ПолноеИмя = "";
	КонецЕсли;

	НовостьXDTO.Автор = ПользовательXDTO;
	НовостьXDTO.Выделить = ДанныеНовости.Выделить;
	НовостьXDTO.Закрепить = ДанныеНовости.Закрепить;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, НовостьXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции


#КонецЕсли
